<?php

return [

    'label' => 'هەناردە :label',

    'modal' => [

        'heading' => 'هەناردە :label',

        'form' => [

            'columns' => [

                'label' => 'ستوونەکان',

                'form' => [

                    'is_enabled' => [
                        'label' => ':column چالاک کراوە',
                    ],

                    'label' => [
                        'label' => ':column لەیبڵ',
                    ],

                ],

            ],

        ],

        'actions' => [

            'export' => [
                'label' => 'هەناردە',
            ],

        ],

    ],

    'notifications' => [

        'completed' => [

            'title' => 'هەناردەکردن تەواو بوو',

            'actions' => [

                'download_csv' => [
                    'label' => 'دابەزاندن .csv',
                ],

                'download_xlsx' => [
                    'label' => 'دابەزاندن .xlsx',
                ],

            ],

        ],

        'max_rows' => [
            'title' => 'هەناردەکردن زۆر گەورەیە',
            'body' => 'لەوانەیە بە یەکجار لە 1 ڕیز زیاتر هەناردە نەکەیت.|ڕەنگە بە یەکجار زیاتر لە ڕیزەکانی :count هەناردە نەکەیت.',
        ],

        'started' => [
            'title' => 'هەناردەکردن دەستی پێکرد',
            'body' => 'هەناردەکردنەکەت دەستی پێکردووە و 1 ڕیز لە پاشبنەمادا پرۆسێس دەکرێت. کاتێک تەواو بوو ئاگادارکردنەوەیەکت پێدەگات لەگەڵ بەستەری دابەزاندن.|هەناردەکردنەکەت دەستی پێکردووە و ڕیزەکانی :count لە پاشبنەمادا پرۆسێس دەکرێن. کاتێک تەواو بوو ئاگادارکردنەوەیەکت پێدەگات لەگەڵ لینکی دابەزاندن.',
        ],

    ],

    'file_name' => 'export-:export_id-:model',

];
