<?php

return [

    'label' => 'هاوردەکردن :label',

    'modal' => [

        'heading' => 'هاوردەکردن :label',

        'form' => [

            'file' => [

                'label' => 'فایل',

                'placeholder' => 'فایلێکی CSV بار بکە',

                'rules' => [
                    'duplicate_columns' => '{0} نابێت فایلەکە زیاتر لە سەردێڕی ستوونی بەتاڵی تێدابێت.|{1,*} نابێت پەڕگەکە سەردێڕی ستوونی دووبارەی تێدابێت: :columns.',
                ],

            ],

            'columns' => [
                'label' => 'ستوونەکان',
                'placeholder' => 'ستوونییەک هەڵبژێرە',
            ],

        ],

        'actions' => [

            'download_example' => [
                'label' => 'نموونەی فایلێکی CSV دابەزێنە',
            ],

            'import' => [
                'label' => 'هاوردەکردن',
            ],

        ],

    ],

    'notifications' => [

        'completed' => [

            'title' => 'هاوردەکردن تەواو بوو',

            'actions' => [

                'download_failed_rows_csv' => [
                    'label' => 'دابەزاندنی زانیاری دەربارەی ڕیزی شکستخواردوو|دابەزاندنی زانیاری دەربارەی ڕیزەکانی شکستخواردوو',
                ],

            ],

        ],

        'max_rows' => [
            'title' => 'فایلە CSV بارکراوەکان زۆر گەورەیە',
            'body' => 'لەوانەیە بە یەکجار زیاتر لە 1 ڕیز هاوردە نەکەیت.|ڕەنگە بە یەکجار زیاتر لە :count ڕیز هاوردە نەکەیت.',
        ],

        'started' => [
            'title' => 'هاوردەکردن دەستی پێکرد',
            'body' => 'هاوردەکردنەکەت دەستی پێکردووە و 1 ڕیز لە پاشبنەمادا پرۆسێس دەکرێت.|هاوردەکردنەکەت دەستیپێکردووە و ڕیزەکانی :count لە پاشبنەمادا پرۆسێس دەکرێن.',
        ],

    ],

    'example_csv' => [
        'file_name' => ':importer-example',
    ],

    'failure_csv' => [
        'file_name' => 'import-:import_id-:csv_name-failed-rows',
        'error_header' => 'هەڵە',
        'system_error' => 'هەڵەی سیستەم، تکایە پەیوەندی بە پشتگیرییەوە بکە.',
    ],

];
