<?php

return [

    'label' => 'Արտահանում :label',

    'modal' => [

        'heading' => 'Արտահանում :label',

        'form' => [

            'columns' => [

                'label' => 'Սյունակներ',

                'form' => [

                    'is_enabled' => [
                        'label' => ':column միացված է',
                    ],

                    'label' => [
                        'label' => ':column պիտակ',
                    ],

                ],

            ],

        ],

        'actions' => [

            'export' => [
                'label' => 'Արտահանում',
            ],

        ],

    ],

    'notifications' => [

        'completed' => [

            'title' => 'Արտահանումն ավարտված է',

            'actions' => [

                'download_csv' => [
                    'label' => 'Բեռնել .csv',
                ],

                'download_xlsx' => [
                    'label' => 'Բեռնել .xlsx',
                ],

            ],

        ],

        'max_rows' => [
            'title' => 'Արտահանումը չափազանց մեծ է',
            'body' => 'Դուք չեք կարող միաժամանակ արտահանել ավելի քան 1 տող։|Դուք չեք կարող միաժամանակ արտահանել ավելի քան :count տող։',
        ],

        'started' => [
            'title' => 'Արտահանումը սկսվել է',
            'body' => 'Ձեր արտահանումը սկսվել է, և 1 տողը կմշակվի հետին պլանում։ Ավարտելուց հետո դուք կստանաք ծանուցում ներբեռնման հղումով։ Ձեր արտահանումը սկսվել է, և հետին պլանում կմշակվի. տողերի քանակը։ Ավարտելուց հետո դուք կստանաք ծանուցում ներբեռնման հղումով։',
        ],

    ],

    'file_name' => 'export-:export_id-:model',

];
